job_code = {
    # "외식ㆍ음료"
    "1000": {
        '1121' : '서빙',
        '1122' : '주방장ㆍ조리사',
        '1123' : '주방보조ㆍ설거지',
        '1124' : '바리스타',
        '1125' : '제과제빵사',
        '1010' : '일반음식점',
        '1020' : '레스토랑',
        '1030' : '패밀리레스토랑',
        '1040' : '패스트푸드점',
        '1050' : '치킨ㆍ피자전문점',
        '1060' : '커피전문점',
        '1070' : '아이스크림ㆍ디저트',
        '1080' : '베이커리ㆍ도넛ㆍ떡',
        '1090' : '호프ㆍ일반주점',
        '1110' : '급식ㆍ푸드시스템',
        '1120' : '도시락ㆍ반찬'
    },
    # "매장관리ㆍ판매"
    "2000": {
        '2121' : '매장관리ㆍ판매',
        '2122' : '캐셔ㆍ카운터',
        '2123' : '판촉도우미',
        '2124' : 'MDㆍ쇼핑몰운영',
        '2010' : '백화점ㆍ쇼핑몰',
        '2020' : '유통점ㆍ마트',
        '2137' : '도소매ㆍ전통시장',
        '2030' : '편의점',
        '2050' : '의류ㆍ잡화ㆍ쥬얼리매장',
        '2060' : '뷰티ㆍ헬스스토어',
        '2070' : '휴대폰ㆍ전자기기매장',
        '2080' : '가구ㆍ침구ㆍ인테리어',
        '2138' : '생활용품샵',
        '2090' : '서점ㆍ문구ㆍ팬시',
        '2100' : '약국',
        '2110' : '농수산ㆍ청과ㆍ축산',
        '2120' : '화훼ㆍ꽃집',
        '2125' : '스터디룸ㆍ독서실ㆍ고시원',
        '2126' : 'PC방',
        '2127' : '노래방',
        '2128' : '볼링ㆍ당구장',
        '2129' : '스크린 골프ㆍ야구',
        '2130' : 'DVDㆍ멀티방ㆍ만화카페',
        '2131' : '오락실ㆍ게임장',
        '2132' : '이색테마카페',
        '2133' : '키즈카페',
        '2134' : '찜질방ㆍ사우나ㆍ스파',
        '2135' : '피트니스ㆍ스포츠',
        '2136' : '고속도로휴게소',
        '2990' : '매장관리ㆍ판매 기타'
    },
    # "서비스"
    "4000": {
       '4221' : '놀이공원ㆍ테마파크',
       '4222' : '호텔ㆍ리조트ㆍ숙박',
       '4223' : '여행ㆍ캠프ㆍ레포츠',
       '4224' : '영화관ㆍ공연장',
       '4225' : '전시ㆍ컨벤션ㆍ세미나',
       '4070' : '안내데스크ㆍ리셉션',
       '4090' : '주차유도ㆍ안내',
       '4095' : '보안ㆍ경비ㆍ경호',
       '4100' : '주유ㆍ세차',
       '4228' : '렌터카ㆍ차량관리',
       '4120' : '전단지배포',
       '4130' : '청소ㆍ미화',
       '4135' : '렌탈관리ㆍA/S',
       '4227' : '골프캐디',
       '4140' : '헤어ㆍ미용ㆍ네일샵',
       '4149' : '피부관리ㆍ마사지',
       '4160' : '반려동물케어',
       '4170' : '베이비시터ㆍ가사도우미',
       '4180' : '결혼ㆍ연회ㆍ장례도우미',
       '4200' : '이벤트ㆍ행사스텝',
       '4210' : '나레이터모델',
       '4220' : '피팅모델',
       '4226' : '공인중개',
       '4990' : '서비스 기타'
    },
    # "사무직"
    "6000": {
        '6010' : '사무보조',
        '6015' : '문서작성ㆍ자료조사',
        '6082' : '데이터수집ㆍ가공',
        '6020' : '비서',
        '6030' : '경리ㆍ회계보조',
        '6033' : '인사ㆍ총무',
        '6036' : '마케팅ㆍ광고ㆍ홍보',
        '6081' : '바이럴ㆍSNS마케팅',
        '6050' : '번역ㆍ통역',
        '6055' : '복사ㆍ출력ㆍ제본',
        '6060' : '편집ㆍ교정ㆍ교열',
        '6070' : '공공기관ㆍ공기업ㆍ협회',
        '6080' : '학교ㆍ도서관ㆍ교육기관'
    },
    # "고객상담ㆍ리서치ㆍ영업"
    "7000": {
        '7010' : '고객상담ㆍ인바운드',
        '7020' : '텔레마케팅ㆍ아웃바운드',
        '7051' : '쇼핑몰인바운드',
        '7025' : '금융ㆍ보험영업',
        '7030' : '오프라인영업ㆍ판매',
        '7040' : '설문조사ㆍ리서치',
        '7052' : '콜센터관리ㆍ모니터링',
        '7050' : '영업관리ㆍ지원'
    },
    # "생산ㆍ건설ㆍ노무"
    "8000": {
        '8020' : '제조ㆍ가공ㆍ조립',
        '8040' : '포장ㆍ품질검사',
        '8050' : '입출고ㆍ창고관리',
        '8056' : '상하차ㆍ소화물 분류',
        '8111' : '물류피킹ㆍ포장ㆍ전산',
        '8112' : '지게차운전',
        '8113' : '금형ㆍ사출ㆍ프레스ㆍ사상',
        '8114' : '반도체ㆍ전자부품생산',
        '8115' : '기계조작ㆍ오퍼레이터',
        '8075' : '정비ㆍ수리ㆍ설치ㆍA/S',
        '8116' : '전기ㆍ시설물관리',
        '8117' : '운반ㆍ설치ㆍ철거',
        '8085' : '공사ㆍ건설현장',
        '8095' : '전기ㆍ칸막이ㆍ배관공사',
        '8118' : '인테리어ㆍ보수공사',
        '8100' : '조선소',
        '8110' : '재단ㆍ재봉',
        '8990' : '생산ㆍ건설ㆍ노무 기타'
    },
    # "ITㆍ기술"
    "9000": {
        '9005' : '웹ㆍ콘텐츠기획',
        '9010' : '사이트관리ㆍ기술지원',
        '9060' : '프로그래머',
        '9061' : 'HTML코딩',
        '9063' : 'QAㆍ테스터ㆍ검증',
        '9066' : '시스템ㆍ네트워크ㆍ보안',
        '9070' : 'PCㆍ디지털기기 설치ㆍ관리'
    },
    # "교육 강사"
    "A000": {
        'A010' : '입시ㆍ보습학원',
        'A020' : '외국어ㆍ어학원',
        'A091' : '독서ㆍ논술ㆍ스피치학원',
        'A030' : '컴퓨터ㆍ정보통신',
        'A033' : '요가ㆍ필라테스 강사',
        'A036' : '피트니스 트레이너',
        'A038' : '레져스포츠 강사',
        'A040' : '예체능 강사',
        'A050' : '유아ㆍ유치원',
        'A092' : '등하원ㆍ승하차도우미',
        'A060' : '방문ㆍ학습지',
        'A070' : '보조교사',
        'A080' : '자격증ㆍ기술학원',
        'A090' : '국비교육기관',
        'A093' : '학원운영지원',
        'A094' : '교재ㆍ교육콘텐츠제작',
        'A990' : '교육ㆍ강사 기타'
    },
    # "디자인"
    "B000": {
        'B010' : '웹ㆍ모바일디자인',
        'B020' : '그래픽ㆍ영상ㆍ편집디자인',
        'B030' : '제품ㆍ산업디자인',
        'B040' : 'CADㆍCAMㆍ인테리어디자인',
        'B050' : '캐릭터ㆍ애니메이션디자인',
        'B060' : '패션ㆍ잡화디자인',
        'B990' : '디자인 기타'
    },
    # "미디어"
    "C000": {
        'C010' : '보조출연ㆍ방청',
        'C020' : '방송스텝ㆍ촬영보조',
        'C030' : '동영상촬영ㆍ편집',
        'C035' : '사진촬영ㆍ편집',
        'C040' : '조명ㆍ음향',
        'C050' : '방송사ㆍ프로덕션',
        'C060' : '신문ㆍ잡지ㆍ출판',
        'C990' : '미디어 기타'
    },
    # "운전ㆍ배달"
    "D000": {
        'D010' : '화물ㆍ운송ㆍ이사',
        'D060' : '택배ㆍ배송기사',
        'D071' : '납품기사',
        'D050' : '중장비ㆍ특수차',
        'D072' : '발렛파킹',
        'D020' : '택시ㆍ대리ㆍ수행기사',
        'D030' : '버스ㆍ셔틀운전',
        'D073' : '퀵서비스',
        'D070' : '배달대행ㆍ음식배달',
        'D074' : '도보배달'
    },
    # "병원ㆍ간호ㆍ연구"
    "E000": {
        'E010' : '간호조무사ㆍ간호사',
        'E071' : '의료기사',
        'E020' : '간병ㆍ요양보호사',
        'E030' : '원무ㆍ코디네이터',
        'E040' : '외래보조ㆍ병동보조',
        'E050' : '수의테크니션ㆍ동물보건사',
        'E060' : '실험ㆍ연구보조',
        'E070' : '생동성ㆍ임상시험'
    }
}




def sub_code_list() :                   # 전체 직종 코드
    sub_code = []

    for i in job_code.keys() :
        sub_code += job_code[i].keys()

    return sub_code


def sub_code_list_part(code) : # 직업분류 별 직종 코드
    result = list(job_code[code].keys())
    return result


def match_alba_name(sub_code) :         # 직종 이름
    alba_name = job_code[sub_code[0]+'000'][sub_code]

    return alba_name


def match_job_code(sub_code) :          # 직업분류
    job_code = sub_code[0] + '000'
    return job_code